nxp-mcuxpresso/mcuxsdk-examples/_boards/mimxrt700evk/eiq_examples/mpp/src/host_video.c
    if (dataLen > 0)
    {
        /* the standard header is 12 bytes */
        if (dataLen > 11)
        {
            dataSize = dataLen - headLength;
            /* there is payload for this transfer */
            if (dataSize)
            {
                if (s_pictureBufferDataLength[videoAppInstance->pictureBufferIndex] == 0U)
                {
                    if (s_currentFrameTimeStamp != presentationTime)
                    {
                        s_currentFrameTimeStamp = presentationTime;
                    }
                }
                /* presention time should be the same for the same frame, if not, discard this picture */
                else if (presentationTime != s_currentFrameTimeStamp)
                {
                    s_savePicture = 0;
                }
                /* the current picture buffers are not available, now discard the receiving picture */
                if ((videoAppInstance->pictureBufferState[videoAppInstance->pictureBufferIndex] && s_savePicture))
                {
                    s_savePicture = 0;
                }
                else if (s_savePicture)
                {
                    if (dataSize > (videoAppInstance->videoCameraPictureBufferSize -
                                    s_pictureBufferDataLength[videoAppInstance->pictureBufferIndex])) /* error here */
                    {
                        s_savePicture                                                   = 0;
                        s_pictureBufferDataLength[videoAppInstance->pictureBufferIndex] = 0U;
                    }
                    else
                    {
                        /* the same frame id indicates they belong to the same frame */
                        if (frame_id == videoAppInstance->expect_frame_id)
                        {
                            /* copy data to picture buffer */
                            memcpy((void *)(((uint8_t *)&s_pictureBuffer[videoAppInstance->pictureBufferIndex][0]) +
                                            s_pictureBufferDataLength[videoAppInstance->pictureBufferIndex]),
                                   (void *)(((uint8_t *)&s_streamBuffer[videoAppInstance->streamBufferIndex][0]) +
                                            headLength),
                                   dataSize);
                            OSA_ENTER_CRITICAL();
                            s_pictureBufferDataLength[videoAppInstance->pictureBufferIndex] += dataSize;
                            OSA_EXIT_CRITICAL();
                        }
                        else /* for the payload that has different frame id, discard it */
                        {
                            s_savePicture = 0;
                        }
                    }
                }
                else
                {
                    /* no action */
                }
            }

            if (s_savePicture)
            {
                if (endOfFrame)
                {
                    if (s_pictureBufferDataLength[videoAppInstance->pictureBufferIndex] != 0)
                    {
                        USB_HostVideoSdcardBufferState(videoAppInstance, videoAppInstance->pictureBufferIndex, 1);
                        videoAppInstance->sdcardPictureLength[videoAppInstance->pictureBufferIndex] =
                            s_pictureBufferDataLength[videoAppInstance->pictureBufferIndex];
                        /* Send message to mpp queue indicating frame is ready */
                        frameReadyMsg.pictureBufferIndex = videoAppInstance->pictureBufferIndex;
                        frameReadyMsg.pictureLength      = s_pictureBufferDataLength[videoAppInstance->pictureBufferIndex];
                        frameReadyMsg.pictureBuffer      = (uint8_t *)&s_pictureBuffer[videoAppInstance->pictureBufferIndex][0];
                        s_pictureBufferDataLength[videoAppInstance->pictureBufferIndex] = 0U;
                        if (xQueueSend(videoAppInstance->mppQueue, &frameReadyMsg, 0) == pdFALSE)
                        {
                            /* Failed to send message to queue, restore buffer state */
                            USB_HostVideoSdcardBufferState(videoAppInstance, videoAppInstance->pictureBufferIndex, 0);
                            videoAppInstance->sdcardPictureLength[videoAppInstance->pictureBufferIndex] = 0;
                            /* Do not switch buffer as it may still be in use by the mpp pipeline*/
                        }
                        else
                        {
                            /* switch to another buffer to save picture frame */
                            videoAppInstance->pictureBufferIndex = 1 - videoAppInstance->pictureBufferIndex;
                        }
                        /* toggle the expected frame id */
                        videoAppInstance->expect_frame_id = 1 - videoAppInstance->expect_frame_id;
                        s_savePicture                     = 1;

                    }
                }
            }
            else
            {
                /* the last frame of one picture */
                if (endOfFrame)
                {
                    if (videoAppInstance->discardFirstPicture)
                    {
                        videoAppInstance->discardFirstPicture = 0;
                        videoAppInstance->expect_frame_id     = 1 - frame_id;
                    }

                    if (s_pictureBufferDataLength[videoAppInstance->pictureBufferIndex] != 0)
                    {
                        videoAppInstance->discardPictureCount++;
                    }
                    s_pictureBufferDataLength[videoAppInstance->pictureBufferIndex] = 0U;
                    if (!videoAppInstance->discardFirstPicture)
                    {
                        videoAppInstance->expect_frame_id = 1 - frame_id;
                    }
                    s_savePicture = 1;
                }
            }
        }
    }

