nxp-mcuxpresso/mcuxsdk-examples/_boards/mimxrt700evk/eiq_examples/mpp/src/host_video.c
            /* malloc enough buffer for one raw data or mjpeg picture */
            if (videoAppInstance->cameraDeviceFormatType == USB_HOST_DESC_SUBTYPE_VS_FORMAT_MJPEG)
            {
                /* print the camera device format info*/
                usb_echo("Camera setting is: %d(w)*%d(h)@%dfps\r\n",
                         ((uint32_t)(USB_SHORT_FROM_LITTLE_ENDIAN_ADDRESS(
                             videoAppInstance->videoStreamMjpegFrameDescriptor->wWitd))),
                         ((uint32_t)(USB_SHORT_FROM_LITTLE_ENDIAN_ADDRESS(
                             videoAppInstance->videoStreamMjpegFrameDescriptor->wHeight))),
                         10000000 / USB_LONG_FROM_LITTLE_ENDIAN_ADDRESS(s_VideoProbe.dwFrameInterval));
                /* the picture buffer byte size */
                videoAppInstance->videoCameraPictureBufferSize =
                    ((uint32_t)(USB_SHORT_FROM_LITTLE_ENDIAN_ADDRESS(
                        videoAppInstance->videoStreamMjpegFrameDescriptor->wHeight))) *
                    ((uint32_t)(USB_SHORT_FROM_LITTLE_ENDIAN_ADDRESS(
                        videoAppInstance->videoStreamMjpegFrameDescriptor->wWitd)));
                /* consider the compression rate of MJPEG, allocate a reasonable size, compression rate can be changed
                 * according to the actual situation */
                videoAppInstance->videoCameraPictureBufferSize = videoAppInstance->videoCameraPictureBufferSize / 100U;
                videoAppInstance->videoCameraPictureBufferSize =
                    videoAppInstance->videoCameraPictureBufferSize * USB_MJPEG_COMPRESSION_RATIO;
#ifdef USB_IMG_BUFFER_DYNALLOC
                s_pictureBuffer_unaligned[0] = (uint32_t *)pvPortMalloc(videoAppInstance->videoCameraPictureBufferSize+CAMERA_DEV_BUFFER_ALIGN-1);
                s_pictureBuffer_unaligned[1] = (uint32_t *)pvPortMalloc(videoAppInstance->videoCameraPictureBufferSize+CAMERA_DEV_BUFFER_ALIGN-1);
                s_pictureBuffer[0] = (uint32_t *) VG_LITE_ALIGN((uint32_t)s_pictureBuffer_unaligned[0], CAMERA_DEV_BUFFER_ALIGN);
                s_pictureBuffer[1] = (uint32_t *) VG_LITE_ALIGN((uint32_t)s_pictureBuffer_unaligned[1], CAMERA_DEV_BUFFER_ALIGN);
#else
                /* Preallocated buffers */
                s_pictureBuffer[0] = (uint32_t *) aImgBuff0;
                s_pictureBuffer[1] = (uint32_t *) aImgBuff1;
                if (videoAppInstance->videoCameraPictureBufferSize > CAMERA_USB_MAX_BUFF_SIZE)
                {
                    s_pictureBuffer[0] = NULL;
                    s_pictureBuffer[1] = NULL;
                    usb_echo("Preallocated USB image buffer too small, required:%d, allocated:%d\r\n", videoAppInstance->videoCameraPictureBufferSize, CAMERA_USB_MAX_BUFF_SIZE);
                }
#endif
                usb_echo("picture format is MJPEG (buff size %d) buff1:%p buff2:%p \r\n",
                		videoAppInstance->videoCameraPictureBufferSize, s_pictureBuffer[0], s_pictureBuffer[1]);
            }
            else if (videoAppInstance->cameraDeviceFormatType == USB_HOST_DESC_SUBTYPE_VS_FORMAT_UNCOMPRESSED)
            {
                usb_echo("Camera setting is: %d(w)*%d(h)@%dfps\r\n",
                         ((uint32_t)(USB_SHORT_FROM_LITTLE_ENDIAN_ADDRESS(
                             videoAppInstance->videoStreamUncompressedFrameDescriptor->wWitd))),
                         ((uint32_t)(USB_SHORT_FROM_LITTLE_ENDIAN_ADDRESS(
                             videoAppInstance->videoStreamUncompressedFrameDescriptor->wHeight))),
                         10000000 / USB_LONG_FROM_LITTLE_ENDIAN_ADDRESS(s_VideoProbe.dwFrameInterval));
                /* Uncompressed format has no compression */
                videoAppInstance->videoCameraPictureBufferSize =
                    ((uint32_t)(videoAppInstance->videoStreamUncompressedFormatDescriptor->bBitsPerPixel / 8U *
                                USB_SHORT_FROM_LITTLE_ENDIAN_ADDRESS(
                                    videoAppInstance->videoStreamUncompressedFrameDescriptor->wHeight))) *
                    ((uint32_t)(USB_SHORT_FROM_LITTLE_ENDIAN_ADDRESS(
                        videoAppInstance->videoStreamUncompressedFrameDescriptor->wWitd)));
                /* allocate one more max packet size buffer to avoid array out of bounds access  */
                videoAppInstance->videoCameraPictureBufferSize += videoAppInstance->unMultipleIsoMaxPacketSize;

#ifdef USB_IMG_BUFFER_DYNALLOC
                s_pictureBuffer_unaligned[0] = (uint32_t *)pvPortMalloc(videoAppInstance->videoCameraPictureBufferSize+CAMERA_DEV_BUFFER_ALIGN-1);
                s_pictureBuffer_unaligned[1] = (uint32_t *)pvPortMalloc(videoAppInstance->videoCameraPictureBufferSize+CAMERA_DEV_BUFFER_ALIGN-1);
                s_pictureBuffer[0] = (uint32_t *) VG_LITE_ALIGN((uint32_t)s_pictureBuffer_unaligned[0], CAMERA_DEV_BUFFER_ALIGN);
                s_pictureBuffer[1] = (uint32_t *) VG_LITE_ALIGN((uint32_t)s_pictureBuffer_unaligned[1], CAMERA_DEV_BUFFER_ALIGN);
#else
                /* Preallocated buffers */
                s_pictureBuffer[0] = (uint32_t *) aImgBuff0;
                s_pictureBuffer[1] = (uint32_t *) aImgBuff1;
                if (videoAppInstance->videoCameraPictureBufferSize > CAMERA_USB_MAX_BUFF_SIZE)
                {
                    s_pictureBuffer[0] = NULL;
                    s_pictureBuffer[1] = NULL;
                    usb_echo("Preallocated USB image buffer too small, required:%d, allocated:%d\r\n", videoAppInstance->videoCameraPictureBufferSize, CAMERA_USB_MAX_BUFF_SIZE);
                }
#endif
                usb_echo("picture format is ");
                if (memcmp(&videoAppInstance->videoStreamUncompressedFormatDescriptor->guidFormat[0],
                           &g_YUY2FormatGUID[0], 16) == 0)
                {
                    usb_echo("YUY2\r\n");
                }
                else if (memcmp(&videoAppInstance->videoStreamUncompressedFormatDescriptor->guidFormat[0],
                                &g_NV12FormatGUID[0], 16) == 0)
                {
                    usb_echo("NV12\r\n");
                }
                else if (memcmp(&videoAppInstance->videoStreamUncompressedFormatDescriptor->guidFormat[0],
                                &g_M420FormatGUID[0], 16) == 0)
                {
                    usb_echo("M420\r\n");
                }
                else if (memcmp(&videoAppInstance->videoStreamUncompressedFormatDescriptor->guidFormat[0],
                                &g_I420FormatGUID[0], 16) == 0)
                {
                    usb_echo("I420\r\n");
                }
                else
                {
                    /* directly print GUID*/
                    for (uint8_t index = 0; index < 16; ++index)
                    {
                        usb_echo("%x ", videoAppInstance->videoStreamUncompressedFormatDescriptor->guidFormat[index]);
                    }
                    usb_echo("\r\n");
                }
            }
            if ((s_pictureBuffer[0] == NULL) || (s_pictureBuffer[1] == NULL))
            {
                usb_echo(
                    "picture buffer malloc failed, please make sure the heap size or prealocation is enough. If it is raw data now, "
                    "please use other format like MJPEG \r\n");
                videoAppInstance->runState     = kUSB_HostVideoRunIdle;
                videoAppInstance->runWaitState = kUSB_HostVideoRunIdle;
                return;
            }

            /* delay to make sure the device camera is ready, delay 2ms */
            SDK_DelayAtLeastUs(2000 * 1000U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
            usb_echo("Start getting pictures from device camera.\r\n");
            usb_echo("Please disconnect camera before powering off the board.\r\n");

            OSA_ENTER_CRITICAL();
            /* prime multiple transfers */
            for (i = 0; i < USB_VIDEO_STREAM_BUFFER_COUNT; i++)
            {
                USB_HosVideoStreamRecv(videoAppInstance->classHandle, (uint8_t *)&s_streamBuffer[i][0],
                                       videoAppInstance->unMultipleIsoMaxPacketSize, USB_HostVideoStreamDataInCallback,
                                       &g_Video);
            }
            OSA_EXIT_CRITICAL();
            videoAppInstance->runState = kUSB_HostVideoStart;
            break;
        }
        case kUSB_HostVideoStart:
            vTaskDelay(pdMS_TO_TICKS(2000));
            /* Do nothing here. Data is sent to MPP hal via USB_HostVideoStreamDataInCallback */
            break;
        default:
            break;
    }
}

usb_status_t USB_HostVideoEvent(usb_device_handle deviceHandle,
                                usb_host_configuration_handle configurationHandle,
                                uint32_t eventCode)
{
    usb_status_t status = kStatus_USB_Success;
    uint8_t id;
    usb_host_configuration_t *configuration;
    uint8_t interface_index;
    usb_host_interface_t *hostInterface;
    uint32_t info_value = 0U;

    switch (eventCode)
    {
        case kUSB_HostEventAttach:
            /* judge whether is configurationHandle supported */
            configuration                 = (usb_host_configuration_t *)configurationHandle;
            g_VideoDeviceHandle           = NULL;
            g_VideoControlInterfaceHandle = NULL;
            g_VideoStreamInterfaceHandle  = NULL;

            for (interface_index = 0U; interface_index < configuration->interfaceCount; ++interface_index)
            {
                hostInterface = &configuration->interfaceList[interface_index];
                id            = hostInterface->interfaceDesc->bInterfaceClass;
                if (id != USB_HOST_VIDEO_CLASS_CODE)
                {
                    continue;
                }
                id = hostInterface->interfaceDesc->bInterfaceSubClass;
                if (id == USB_HOST_VIDEO_SUBCLASS_CODE_CONTROL)
                {
                    g_VideoDeviceHandle           = deviceHandle;
                    g_VideoControlInterfaceHandle = hostInterface;
                    continue;
                }
                else if (id == USB_HOST_VIDEO_SUBCLASS_CODE_STREAM)
                {
                    g_VideoDeviceHandle          = deviceHandle;
                    g_VideoStreamInterfaceHandle = hostInterface;
                    continue;
                }
                else
                {
                }
            }
            if (g_VideoDeviceHandle != NULL)
            {
                return kStatus_USB_Success;
            }
            status = kStatus_USB_NotSupported;
            break;

        case kUSB_HostEventNotSupported:
            break;

        case kUSB_HostEventEnumerationDone:
            if (g_Video.devState == kStatus_DEV_Idle)
            {
                if ((g_VideoDeviceHandle != NULL) && (g_VideoControlInterfaceHandle != NULL))
                {
                    g_Video.devState          = kStatus_DEV_Attached;
                    g_Video.deviceHandle      = g_VideoDeviceHandle;
                    g_Video.controlIntfHandle = g_VideoControlInterfaceHandle;
                    g_Video.streamIntfHandle  = g_VideoStreamInterfaceHandle;

                    USB_HostHelperGetPeripheralInformation(deviceHandle, kUSB_HostGetDevicePID, &info_value);
                    usb_echo("video device attached:pid=0x%x", info_value);
                    USB_HostHelperGetPeripheralInformation(deviceHandle, kUSB_HostGetDeviceVID, &info_value);
                    usb_echo("vid=0x%x ", info_value);
                    USB_HostHelperGetPeripheralInformation(deviceHandle, kUSB_HostGetDeviceAddress, &info_value);
                    usb_echo("address=%d\r\n", info_value);
                }
            }
            else
            {
                usb_echo("not idle vide instance\r\n");
            }
            break;

